## How to Convert a Multi-Value Column to Multiple Rows

In this article, we will talk about how to split one column in which contents are concatenated with a delimiter like a comma to a list. And convert the list column to multiple rows with other columns duplicated.

* Use str.split() to split one column to a list

* Convert the column with a list type value to multiple rows using explode() method

### Preparing Data

In [13]:
import pandas as pd

df = pd.DataFrame({
    "name": ["Kevin", "Jack", "Mary"],
    "sex": ["M", "M", "F"],
    "hobbies": ["Writing,Chess", "Drawing,Coding", "Music,Reading"]
}, index=["K", "J", "M"])

df

    name sex         hobbies
K  Kevin   M   Writing,Chess
J   Jack   M  Drawing,Coding
M   Mary   F   Music,Reading

#### Use str.split() to split a column to a list

In [11]:
df["hobbies"] = df["hobbies"].str.split(",")
df

    name sex            hobbies
K  Kevin   M   [Writing, Chess]
J   Jack   M  [Drawing, Coding]
M   Mary   F   [Music, Reading]

#### Convert the column with a list-type value to multiple rows
You can use explode() method of Pandas to convert a column with list-type values to multiple rows with other columns that are duplicated.

In [12]:
df = df.explode("hobbies")
df

    name sex  hobbies
K  Kevin   M  Writing
K  Kevin   M    Chess
J   Jack   M  Drawing
J   Jack   M   Coding
M   Mary   F    Music
M   Mary   F  Reading